SpenceKonde/megaTinyCore/megaavr/variants/txy6/pins_arduino.h
/*
  pins_arduino.h - Pin definition functions for Arduino
  Part of Arduino - http://www.arduino.cc/

  Copyright (c) 2007 David A. Mellis

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General
  Public License along with this library; if not, write to the
  Free Software Foundation, Inc., 59 Temple Place, Suite 330,
  Boston, MA  02111-1307  USA
*/

#ifndef Pins_Arduino_h
#define Pins_Arduino_h

#include <avr/pgmspace.h>
#include "timers.h"

#if defined(TCD0)
//  #define USE_TIMERD0_PWM
  #define NO_GLITCH_TIMERD0
#endif

#if MEGATINYCORE_SERIES == 2
  /* Yes, this is actually one more than we have, but the way this is used by the code means that it actually needs to be (highest mux channel for a pin +1) */
  #define NUM_ANALOG_INPUTS           (16)
#else
  #define NUM_ANALOG_INPUTS           (12)
#endif

#define NUM_I2C_PINS                  (2) // (SDA / SCL)
#define NUM_SPI_PINS                  (3) // (MISO / MOSI / SCK)
#define NUM_TOTAL_PINS                (18)
#define NUM_DIGITAL_PINS              (18)
#define PINS_COUNT                    (18)

#define EXTERNAL_NUM_INTERRUPTS       (20)

#if (defined(TCD0) && defined(USE_TIMERD0_PWM))
  #define digitalPinHasPWM(p)         ((p) == PIN_PA4 || (p) == PIN_PA5 || (p) == PIN_PB2 || (p) == PIN_PB1 || (p) == PIN_PB0 || (p) == PIN_PC0 || (p) == PIN_PC1 || (p) == PIN_PA3)
#else
  #define digitalPinHasPWM(p)         ((p) == PIN_PA4 || (p) == PIN_PA5 || (p) == PIN_PB2 || (p) == PIN_PB1 || (p) == PIN_PB0                                     || (p) == PIN_PA3)
#endif


#ifdef DAC0 // 1-Series only
  #define DAC_PIN      (PIN_PA6)
#endif

#ifndef LED_BUILTIN
  #define LED_BUILTIN  (PIN_PA7)
#endif


#if MEGATINYCORE_SERIES != 2
  #define digitalPinToAnalogInput(p)  (((p) < 6) ? ((p) + 4) : ((p) == 17 ? 0 : (((p) > 13 && (p) < 17) ? ((p) - 13) : (((p) == 8) ? 10 : ((p) == 9 ? 11 : NOT_A_PIN)))))
  #if defined(ADC1) // 3216 and 1616 only have second ADC.
    #define digitalPinToAnalogInput_ADC1(p) ((p) < 6 ? (p) : ((p) < PINS_COUNT && ((p) >= PIN_PC0) ? (6 + (p) - PIN_PC0) : NOT_A_PIN))
  #endif

#else
  /* 2-series MUX table says ADC channel 0 is tied to ground, not PA0, PC0 through PC3 are a A12-15 */
  #define digitalPinToAnalogInput(p)  (((p) < 6) ? ((p) + 4) : (((p) > 13 && (p) < 17) ? ((p) - 13) : ((((p) >= 8) && ((p) < 14)) ? ((p) + 2) :  NOT_A_PIN)))
#endif

/*
      ####   ###  ####  ##### #   # #   # #   #
      #   # #   # #   #   #   ## ## #   #  # #
      ####  #   # ####    #   # # # #   #   #
      #     #   # # #     #   #   # #   #  # #
      #      ###  #  #    #   #   #  ###  #   #
*/
#define SPI_MUX                       (0)
#define PIN_SPI_SS                    (PIN_PA4)
#define PIN_SPI_MOSI                  (PIN_PA1)
#define PIN_SPI_MISO                  (PIN_PA2)
#define PIN_SPI_SCK                   (PIN_PA3)
#if defined(PORTMUX_SPI0_bm) || defined(PORTMUX_SPIROUTEA)
  #define PIN_SPI_SCK_PINSWAP_1       (PIN_PC0)
  #define PIN_SPI_MISO_PINSWAP_1      (PIN_PC1)
  #define PIN_SPI_MOSI_PINSWAP_1      (PIN_PC2)
  #define PIN_SPI_SS_PINSWAP_1        (PIN_PC3)
  #ifdef PORTMUX_SPI0_bm
    #define SPI_MUX_PINSWAP_1         (PORTMUX_SPI0_bm)
  #else
    #define SPI_MUX_PINSWAP_1         (PORTMUX_SPI0_ALT1_gc)
  #endif
#endif

#define SPI_INTERFACES_COUNT          (1)


#ifdef PORTMUX_TWI0_bm
  #define PIN_WIRE_SDA_PINSWAP_1      (PIN_PA1)
  #define PIN_WIRE_SCL_PINSWAP_1      (PIN_PA2)
#endif
#define PIN_WIRE_SDA                  (PIN_PB1)
#define PIN_WIRE_SCL                  (PIN_PB0)

/* Serial pin values here are not used by the core. They don't get picked up correctly in UART.h where they're needed and I can't figure out why. */
// Serial - All parts with 14 or more pins have all alt and normal pins, and all 4 of them.
#define HWSERIAL0_MUX_DEFAULT           (0)

#define PIN_HWSERIAL0_TX                (PIN_PB2)
#define PIN_HWSERIAL0_RX                (PIN_PB3)
#define PIN_HWSERIAL0_XCK               (PIN_PB1)
#define PIN_HWSERIAL0_XDIR              (PIN_PB0)

#define PIN_HWSERIAL0_TX_PINSWAP_1      (PIN_PA1)
#define PIN_HWSERIAL0_RX_PINSWAP_1      (PIN_PA2)
#define PIN_HWSERIAL0_XCK_PINSWAP_1     (PIN_PA3)
#define PIN_HWSERIAL0_XDIR_PINSWAP_1    (PIN_PA4)

#if defined(USART1)
  // Serial1 on tinyAVR 2-series only, and uses as default pins USART0's alternate pins
  #define HWSERIAL1_MUX_DEFAULT         (0)

  #define PIN_HWSERIAL1_TX              (PIN_PA1)
  #define PIN_HWSERIAL1_RX              (PIN_PA2)
  #define PIN_HWSERIAL1_XCK             (PIN_PA3)
  #define PIN_HWSERIAL1_XDIR            (PIN_PA4)

  #define PIN_HWSERIAL1_TX_PINSWAP_1    (PIN_PC2)
  #define PIN_HWSERIAL1_RX_PINSWAP_1    (PIN_PC1)
  #define PIN_HWSERIAL1_XCK_PINSWAP_1   (PIN_PC0)
  #define PIN_HWSERIAL1_XDIR_PINSWAP_1  (PIN_PC3)
#endif

/*
       ##  #   #  ##  #     ###   ###      ####  ### #   #  ###
      #  # ##  # #  # #    #   # #         #   #  #  ##  # #
      #### # # # #### #    #   # #  ##     ####   #  # # #  ###
      #  # #  ## #  # #    #   # #   #     #      #  #  ##     #
      #  # #   # #  # ####  ###   ###      #     ### #   #  ###
*/

#define PIN_PA4         (0)
#define PIN_PA5         (1)
#define PIN_PA6         (2)
#define PIN_PA7         (3)
#define PIN_PB5         (4)
#define PIN_PB4         (5)
#define PIN_PB3         (6)
#define PIN_PB2         (7)
#define PIN_PB1         (8)
#define PIN_PB0         (9)
#define PIN_PC0        (10)
#define PIN_PC1        (11)
#define PIN_PC2        (12)
#define PIN_PC3        (13)
#define PIN_PA0        (17)
#define PIN_PA1        (14)
#define PIN_PA2        (15)
#define PIN_PA3        (16)

