SpenceKonde/megaTinyCore/megaavr/variants/txy6/pins_arduino.h
#if MEGATINYCORE_SERIES != 2
  #define PIN_A0       (A0)
#endif
#define PIN_A1         (A1)
#define PIN_A2         (A2)
#define PIN_A3         (A3)
#define PIN_A4         (A4)
#define PIN_A5         (A5)
#define PIN_A6         (A6)
#define PIN_A7         (A7)
#define PIN_A8         (A8)
#define PIN_A9         (A9)
#define PIN_A10       (A10)
#define PIN_A11       (A11)
#if MEGATINYCORE_SERIES == 2
  #define PIN_A12     (A12)
  #define PIN_A13     (A13)
  #define PIN_A14     (A14)
  #define PIN_A15     (A15)
#endif

#if MEGATINYCORE_SERIES != 2
  static const uint8_t   A0 = PIN_PA0;
#endif
static const uint8_t     A1 = PIN_PA1;
static const uint8_t     A2 = PIN_PA2;
static const uint8_t     A3 = PIN_PA3;
static const uint8_t     A4 = PIN_PA4;
static const uint8_t     A5 = PIN_PA5;
static const uint8_t     A6 = PIN_PA6;
static const uint8_t     A7 = PIN_PA7;
static const uint8_t     A8 = PIN_PB5;
static const uint8_t     A9 = PIN_PB4;
static const uint8_t    A10 = PIN_PB1;
static const uint8_t    A11 = PIN_PB0;
#if MEGATINYCORE_SERIES == 2
  static const uint8_t  A12 = PIN_PC0;
  static const uint8_t  A13 = PIN_PC1;
  static const uint8_t  A14 = PIN_PC2;
  static const uint8_t  A15 = PIN_PC3;
#endif

/* Not Recommended to use the AINn constants */
#if MEGATINYCORE_SERIES != 2
  #define AIN0               NOT_A_PIN
#endif
#define AIN1               ADC_CH(1)
#define AIN2               ADC_CH(2)
#define AIN3               ADC_CH(3)
#define AIN4               ADC_CH(4)
#define AIN5               ADC_CH(5)
#define AIN6               ADC_CH(6)
#define AIN7               ADC_CH(7)
#define AIN8               ADC_CH(8)
#define AIN9               ADC_CH(9)
#define AIN10              ADC_CH(10)
#define AIN11              ADC_CH(11)
#if MEGATINYCORE_SERIES == 2
  #define AIN12              ADC_CH(12)
  #define AIN13              ADC_CH(13)
  #define AIN14              ADC_CH(14)
  #define AIN15              ADC_CH(15)
#endif
/*
            ####  ### #   #      ##  ####  ####   ##  #   #  ###
            #   #  #  ##  #     #  # #   # #   # #  #  # #  #
            ####   #  # # #     #### ####  ####  ####   #    ###
            #      #  #  ##     #  # # #   # #   #  #   #       #
            #     ### #   #     #  # #  #  #  #  #  #   #    ###
*/
#ifdef ARDUINO_MAIN

// On the Arduino board, digital pins are also used
// for the analog output (software PWM).  Analog input
// pins are a separate set.

// ATtiny1616 / ARDUINO
//                          _____
//                  VDD   1|*    |20  GND
// (nSS)  (AIN4) PA4  0~  2|     |19  16~ PA3 (AIN3)(SCK)(EXTCLK)
//        (AIN5) PA5  1~  3|     |18  15  PA2 (AIN2)(MISO)
// (DAC)  (AIN6) PA6  2   4|     |17  14  PA1 (AIN1)(MOSI)
//        (AIN7) PA7  3   5|     |16  17  PA0 (AIN0/nRESET/UPDI)
//        (AIN8) PB5  4   6|     |15  13  PC3
//        (AIN9) PB4  5   7|     |14  12  PC2
// (RXD) (TOSC1) PB3  6   8|     |13  11~ PC1 (PWM only on 1-series)
// (TXD) (TOSC2) PB2  7~  9|     |12  10~ PC0 (PWM only on 1-series)
// (SDA) (AIN10) PB1  8~ 10|_____|11   9~ PB0 (AIN11)(SCL)
//
//

/*  0/1-series. ADC1, TCB1 and AC1, AC2 present only on 16/32k 1-series. TCD0, DAC0, alternate SPI/I2C pins and AC0 inputs past 0 only available on 1-series.

  PIN#   DESC         Pin Name  Other/Sp  ADC0      ADC1      PTC       AC0       AC1       AC2       DAC0      USART0    SPI0      TWI0      TCA(PWM)  TCBn      TCD0      CCL
  0                   PA4                 AIN4      AIN0      X0/Y0                                              XDIR      SS                  WO4                WOA        LUT0-OUT
  1                   PA5       VREFA     AIN5      AIN1      X1/Y1     OUT       AINN0                                                        WO5       TCB0 WO  WOB
  2      DAC          PA6                 AIN6      AIN2      X2/Y2     AINN0     AINP1     AINP0     OUT
  3      LED          PA7                 AIN7      AIN3      X3/Y3     AINP0     AINP0     AINN0                                                                            LUT1-OUT
  4                   PB5       CLKOUT    AIN8                          AINP1               AINP2                                             *WO2
  5                   PB4                 AIN9                          AINN1     AINP3                                                       *WO1                          *LUT0-OUT
  6      RX           PB3       TOSC1                                             OUT                            RxD                          *WO0
  7      TX           PB2    TOSC2/EVOUT1                                                   OUT                  TxD                           WO2
  8      SDA          PB1                 AIN10               X4/Y4     AINP2                                    XCK                SDA        WO1
  9      SCL          PB0                 AIN11               X5/Y5               AINP2     AINP1                XDIR               SCL        WO0
  10                  PC0                           AIN6                                                                  *SCK                          *TCB0 WO  WOC
  11                  PC1                           AIN7                                                                  *MISO                                   WOD       *LUT1-OUT
  12                  PC2       EVOUT2              AIN8                                                                  *MOSI
  13                  PC3                           AIN9                                                                  *SS                 *WO3                           LUT1-IN0
  17     UPDI         PA0     RESET/UPDI  AIN0                                                                                                                               LUT0-IN0
  14     MOSI         PA1                 AIN1                                                                  *TxD       MOSI     *SDA                                     LUT0-IN1
  15     MISO         PA2       EVOUT0    AIN2                                                                  *RxD       MISO     *SCL                                     LUT0-IN2
  16     SCK          PA3       EXTCLK    AIN3                                                                  *XCK       SCK                 WO3       TCB1 WO
      * alternative pin locations


  2-series
  PIN#   DESC         Pin Name  Other/Sp  ADC0      AC0       USART0    SPI0      TWI0      TCA(PWM)  TCBn      CCL
  0                   PA4                 AIN4                XDIR      SS                   WO4                 LUT0-OUT
  1                   PA5       VREFA     AIN5      OUT                                      WO5      TCB0 WO   *LUT3-OUT
  2                   PA6                 AIN6      AINN0
  3      LED          PA7      *EVOUTA    AIN7      AINP0                                                        LUT1-OUT
  4                   PB5       CLKOUT    AIN8      AINP1                                   *WO2
  5      Alt Reset    PB4                 AIN9      AINN1                                   *WO1                *LUT0-OUT
  6      RX           PB3       TOSC1                         RxD                           *WO0
  7      TX           PB2   TOSC2/EVOUTB                      TxD                            WO2                 LUT2-IN2
  8      SDA          PB1                 AIN10     AINP2     XCK                 SDA        WO1                 LUT2-IN1
  9      SCL          PB0                 AIN11               XDIR                SCL        WO0                 LUT2-IN0
  10                  PC0                                               *SCK                          *TCB0 WO   LUT3-IN0
  11                  PC1                                               *MISO                                   *LUT1-OUT/LUT3-IN1
  12                  PC2       EVOUTC                                  *MOSI                                    LUT3-IN2
  13                  PC3                                               *SS                 *WO3                 LUT1-IN0
  17     UPDI         PA0       RESET/UPDI                                                                       LUT0-IN0
  14     MOSI         PA1                 AIN1                *TxD      MOSI      *SDA                           LUT0-IN1
  15     MISO         PA2       EVOUTA    AIN2                *RxD      MISO      *SCL                           LUT0-IN2
  16     SCK          PA3       EXTCLK    AIN3                *XCK      SCK                 WO3       TCB1 WO
     * alternative pin locations
*/


  const uint8_t digital_pin_to_port[] = {
    // Left side, top to bottom
    PA, // 0  PA4
    PA, // 1  PA5
    PA, // 2  PA6
    PA, // 3  PA7
    PB, // 4  PB5
    PB, // 5  PB4
    PB, // 6  PB3
    PB, // 7  PB2
    PB, // 8  PB1
    // Right side, bottom to top
    PB, // 9  PB0
    PC, // 10 PC0
    PC, // 11 PC1
    PC, // 12 PC2
    PC, // 13 PC3
    // skip PA0 until the end
    PA, // 14 PA1
    PA, // 15 PA2
    PA, // 16 PA3
    PA  // 17 PA0 UPDI/RST
  };

